## Pandas Tutorial_part13
**Pandas Read-write data From Database:** reading database records into pandas dataframe and writing back to it.

In [2]:
import pandas as pd
import sqlalchemy

![](conn_string_format.jpg)

In [7]:
# First of all you need to install both 'sqlalchemy=> pip install sqlalchemy' and 'PyMySQL=> pip install PyMySQL'.
# Database name is 'test1'
# MySQL server must be on.
engine = sqlalchemy.create_engine("mysql+pymysql://root:@localhost:3306/test1")

**Let's have couple of tables like as follow:**

![](db_tables.jpg)

In [8]:
# Reading customer table records...
df=pd.read_sql_table("customers",engine)
df

   id   name  phone_number
0   1    ali     787667564
1   2  ahmad      77765765
2   3  wakil     798767864

In [10]:
# We can also read a few records.
df=pd.read_sql_table("customers", engine, columns=['name', 'phone_number'])
df

    name  phone_number
0    ali     787667564
1  ahmad      77765765
2  wakil     798767864

In [12]:
# We can join both the tables which are in test1 db and write their data into pandas:
query='''
Select customers.name, customers.phone_number, orders.name, orders.amount
From customers INNER JOIN orders
ON customers.id=orders.customer_id
'''
df=pd.read_sql_query(query, engine)
df

    name  phone_number    name  amount
0    ali     787667564  Farhad      40
1  wakil     798767864   Nasim      35
2  ahmad      77765765  Faisal      50

In [13]:
# The upper query is very simple, if you have big reports to read then you can use 'chunksize' argument.
# For other argument you can check 'pandas.read_sql_query' documentation.

In [16]:
# Now let's have a reverse operations, means back writing from DataFrame into 'sql tables':
# So here we have .csv file which have a customer data, we want to load it into customer table.
df=pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [18]:
# Here we have one problem, it's we have different columns name in our dataframe then the original table column names, so we can rename it:
df.rename(columns={
    'Customer Name': "name",
    'Customer Phone': "phone_number"
}, inplace=True)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [19]:
# So now we can use do_sql method to insert data into mysql table:
df.to_sql(
    name = 'customers',
    con = engine,
    index = False,
    if_exists = 'append'
)

6

In [20]:
# So the upper 'to_sql' method doesn't give an error, it means data is successully inserted into mysql table.

In [21]:
# We can also use 'read_sql' method to read the data:
pd.read_sql("customers", engine)

   id             name  phone_number
0   1              ali     787667564
1   2            ahmad      77765765
2   3            wakil     798767864
3   4     rafael nadal    2147483647
4   5  maria sharapova     434534545
5   6   vladimir putin      89345345
6   7      kim un jong     123434456
7   8       jeff bezos     934534543
8   9     rahul gandhi      44324222

In [22]:
# We can also pass a query to 'read_sql' method.
query='''
Select customers.name
From customers
Where customers.id=2
'''
pd.read_sql(query, engine)

    name
0  ahmad

In [23]:
# That's were all about 'Pandas Read_Write Data from DB'